/********************************************************************************************************    
*                                                         
*                                     Address
*  
*                    (c) Copyright 20xx, Company Name, City, State
*                                All Rights Reserved
*
*
* FileName       : gpio.h
* Version        : V2.0
* Programmer(s)  : zhaojun_xf
* Parameters     : LPC1700 12.000MHz
* DebugTools     : Realview MDK V4.23  JLINK V8(SWD)
* Description    : 
*				   所有I/O口在复位后默认为上拉输入，PORT0和PORT2端口的每个引脚都可以提供中断功能
*
*
********************************************************************************************************/

#ifndef __GPIO_H 
#define __GPIO_H

/********************************************************************************************************
* Macro Definition                                                
********************************************************************************************************/
#define PIN_OFFSET				(0x00004)										  // 各寄存器偏移地址
#define PIN_REG(addr)           (*((volatile u32*)addr))                          // 寄存器地址

/***********************************************************************************************************
** 方向配置
***********************************************************************************************************/
#define GPIO_IN                 (0x00)                                            // 输入端口                 
#define GPIO_OUT                (0x01)                                            // 输出端口

#define GPIO_CLR                (0x00)                                            // 清零                 
#define GPIO_SET                (0x01)                                            // 置一   

/******************************************************************************************************** 
* 【枚举变量】 Enumerations                                                
********************************************************************************************************/
typedef enum
{
    PORT0 = 0,
	PORT1 = 1,
	PORT2 = 2,
	PORT3 = 3,
	PORT4 = 4,

} PORT;																			  // 端口

/********************************************************************************************************
** P0口引脚功能设置
********************************************************************************************************/

// -----------------------------  PIO0_0  ---------------------------------------------------------------
// FUNC 选择管脚功能
#define	PIO0_0_GPIO             (0x00)                                            // GPIO                         
#define PIO0_0_RD1              (0x01)                                            // CAN-1控制器接收引脚          
#define PIO0_0_TXD3             (0x02)                                            // UART3发送引脚                
#define PIO0_0_SDA1             (0x03)                                            // I2C-1数据线（开漏）          

// -----------------------------  PIO0_1  ---------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO0_1_GPIO             (0x00)                                            // GPIO                         
#define PIO0_1_TD1              (0x01)                                            // CAN-1控制器发送引脚          
#define PIO0_1_RXD3             (0x02)                                            // UART3接收引脚                
#define PIO0_1_SCL1             (0x03)                                            // I2C-1时钟线（开漏）          
		
// -----------------------------  PIO0_2  ---------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO0_2_GPIO             (0x00)                                            // GPIO                      
#define PIO0_2_TXD0             (0x01)                                            // UART0发送引脚             
#define PIO0_2_AD07             (0x02)                                            // AD0.7引脚                 
//...   Reserved                (0x03)				                              // 保留

// -----------------------------  PIO0_3  ---------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO0_3_GPIO             (0x00)                                            // GPIO                         
#define PIO0_3_RXD0             (0x01)                                            // UART0接收引脚                
#define PIO0_3_AD06             (0x02)                                            // AD0.6引脚                   
//...   Reserved                (0x03) 				                              // 

// -----------------------------  PIO0_4  ---------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO0_4_GPIO             (0x00)                                            // GPIO                         
#define PIO0_4_I2SRX_CLK        (0x01)                                            // I2S总线接收时钟SCK           
#define PIO0_4_RD2              (0x02)                                            // CAN-2接收线                  
#define PIO0_4_CAP20            (0x03)                                            // 定时器2捕获输入，通道0      

// -----------------------------  PIO0_5  ---------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO0_5_GPIO             (0x00)                                            // GPIO                         
#define PIO0_5_I2SRX_WS         (0x01)                                            // I2S总线接收字选择WS         
#define PIO0_5_TD2              (0x02)                                            // CAN-2发送线                 
#define PIO0_5_CAP21            (0x03)                                            // 定时器2捕获输入，通道1      

// -----------------------------  PIO0_6  ---------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO0_6_GPIO             (0x00)                                            // GPIO                         
#define PIO0_6_I2SRX_SDA        (0x01)                                            // I2S总线接收数据线SD          
#define PIO0_6_SSEL1            (0x02)                                            // SSP-1总线从机选择            
#define PIO0_6_MAT20            (0x03)                                            // 定时器2匹配输出，通道0       

// -----------------------------  PIO0_7  ---------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO0_7_GPIO             (0x00)                                            // GPIO                         
#define PIO0_7_I2STX_CLK        (0x01)                                            // I2S总线发送时钟线SCK         
#define PIO0_7_SCK1             (0x02)                                            // SSP-1时钟线                  
#define PIO0_7_MAT21            (0x03)                                            // 定时器2匹配输出，通道1       

// -----------------------------  PIO0_8  ---------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO0_8_GPIO             (0x00)                                            // GPIO                         
#define PIO0_8_I2STX_WS         (0x01)                                            // I2S总线发送字选择WS          
#define PIO0_8_MISO1            (0x02)                                            // SSP-1主输入从输出数据线     
#define PIO0_8_MAT22            (0x03)                                            // 定时器2匹配输出，通道2      

// -----------------------------  PIO0_9  ---------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO0_9_GPIO             (0x00)                                            // GPIO                         
#define PIO0_9_I2STX_SDA        (0x01)                                            // I2S总线发送数据线SD          
#define PIO0_9_MOSI1            (0x02)                                            // SSP-1主输出从输入数据线      
#define PIO0_9_MAT23            (0x03)                                            // 定时器2匹配输出，通道3       

// -----------------------------  PIO0_10  ------------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO0_10_GPIO            (0x00)                                            // GPIO                         
#define PIO0_10_TXD2            (0x01)                                            // UART2发送引脚                
#define PIO0_10_SDA2            (0x02)                                            // I2C-2数据线(非开漏引脚)      
#define PIO0_10_MAT30           (0x03)                                            // 定时器3匹配输出，通道0                   
  
// -----------------------------  PIO0_11  ----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO0_11_GPIO            (0x00)                                            // GPIO                         
#define PIO0_11_RXD2            (0x01)                                            // UART2接收引脚                
#define PIO0_11_SCL2            (0x02)                                            // I2C-2时钟线(非开漏引脚)      
#define PIO0_11_MAT31           (0x03)                                            // 定时器3匹配输出，通道1                  
    
// -----------------------------  PIO0_15  ----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO0_15_GPIO            (0x00)                                            // GPIO                         
#define PIO0_15_TXD1            (0x01)                                            // UART1发送引脚                
#define PIO0_15_SCK0            (0x02)                                            // SSP0时钟线                   
#define PIO0_15_SCK             (0x03)                                            // SPI时钟线                                                                                 
                                                   
// -----------------------------  PIO0_16  ----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO0_16_GPIO            (0x00)                                            // GPIO                         
#define PIO0_16_RXD1            (0x01)                                            // UART1接收引脚                
#define PIO0_16_SSEL0           (0x02)                                            // SSP0从机选择                 
#define PIO0_16_SSEL            (0x03)                                            // SPI从机选择                                                                           
                                                
// -----------------------------  PIO0_17  ----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO0_17_GPIO            (0x00)                                            // GPIO                         
#define PIO0_17_CTS1            (0x01)                                            // UART1清零发送信号CTS         
#define PIO0_17_MISO0           (0x02)                                            // SSP0主输入从输出数据线       
#define PIO0_17_MISO            (0x03)                                            // SPI主入从出数据线            
                                                
// -----------------------------  PIO0_18  ----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO0_18_GPIO            (0x00)                                            // GPIO                         
#define PIO0_18_DCD1            (0x01)                                            // UART1数据载波检测输入DCD     
#define PIO0_18_MOSI0           (0x02)                                            // SSP-0主输出从输入数据线      
#define PIO0_18_MOSI            (0x03)                                            // SPI主出从入数据线                      
                                                
// -----------------------------  PIO0_19  ----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO0_19_GPIO            (0x00)                                            // GPIO                         
#define PIO0_19_DSR1            (0x01)                                            // UART1数据设置就绪DSR         
//...   Reserved                (0x02)                                            // 保留                         
#define PIO0_19_SDA1            (0x03)                                            // I2C-1数据线（非开漏）                                                             
                                                
// -----------------------------  PIO0_20  ----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO0_20_GPIO            (0x00)                                            // GPIO                         
#define PIO0_20_DTR1            (0x01)                                            // UART1终端就绪DTR             
//...   Reserved                (0x02)                                            // 保留                         
#define PIO0_20_SCL1            (0x03)                                            // I2C-1时钟线（非开漏）        
                                           
// -----------------------------  PIO0_21  ----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO0_21_GPIO            (0x00)                                            // GPIO                         
#define PIO0_21_RI1             (0x01)                                            // UART1振铃信号                
//...   Reserved                (0x02)                                            // 保留                         
#define PIO0_21_RD1             (0x03)                                            // CAN-1接收引脚                
                                      
// -----------------------------  PIO0_22  ----------------------------------------------------------------
// FUNC 选择管脚功能 
#define PIO0_22_GPIO            (0x00)                                            // GPIO                         
#define PIO0_22_RTS1            (0x01)                                            // UART1请求发送引脚            
//...   Reserved                (0x02)                                            // 保留                         
#define PIO0_22_TD1             (0x03)                                            // CAN-1发送线                  
                                      
// -----------------------------  PIO0_23  ----------------------------------------------------------------
// FUNC 选择管脚功能 
#define PIO0_23_GPIO            (0x00)                                            // GPIO                         
#define PIO0_23_AD00            (0x01)                                            // ADC-0，通道0                 
#define PIO0_23_I2SRX_CLK       (0x02)                                            // I2S接收时钟SCK               
#define PIO0_23_CAP30           (0x03)                                            // 定时器3捕获输入，通道0       
                                                                           
// -----------------------------  PIO0_24  ----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO0_24_GPIO            (0x00)                                            // GPIO                         
#define PIO0_24_AD01            (0x01)                                            // ADC-0，通道1                 
#define PIO0_24_I2SRX_WS        (0x02)                                            // I2S接收字选择WS              
#define PIO0_24_CAP31           (0x03)                                            // 定时器3捕获输入，通道1       
                                      
// -----------------------------  PIO0_25  ----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO0_25_GPIO            (0x00)                                            // GPIO                         
#define PIO0_25_AD02            (0x01)                                            // ADC-0，通道2                 
#define PIO0_25_I2SRX_SDA       (0x02)                                            // I2S接收数据SD                
#define PIO0_25_TXD3            (0x03)                                            // UART3发送引脚                
                                  
// -----------------------------  PIO0_26  ----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO0_26_GPIO            (0x00)                                            // GPIO                         
#define PIO0_26_AD03            (0x01)                                            // ADC-0，通道3                 
#define PIO0_26_AOUT            (0x02)                                            // DAC输出                      
#define PIO0_26_RXD3            (0x03)                                            // UART-3接收引脚               

/* 引脚选择模式不能用于引脚P0.27至P0.30。引脚P0.27和P0.28为专用的I2C开漏引脚，没有上拉/下拉 */ 
                                         
// -----------------------------  PIO0_27  ----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO0_27_GPIO            (0x00)                                            // GPIO                         
#define PIO0_27_SDA0            (0x01)                                            // I2C0数据输入/输出，开漏      
#define PIO0_27_USB_SDA         (0x02)                                            // USB接口I2C串行数据OTG收发器  
//..    Reserved                (0x03)                                            // 保留                         
                                          
// -----------------------------  PIO0_28  ----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO0_28_GPIO            (0x00)                                            // GPIO                         
#define PIO0_28_SCL0            (0x01)                                            // I2C0时钟输入，开漏           
#define PIO0_28_USB_SCL         (0x02)                                            // USB接口I2C时钟线，OTG收发器  
//..    Reserved                (0x03)                                            // 保留 

/* 引脚P0.29、P0.30为USB特定的引脚，不能配置为上拉或下拉电阻控制。引脚P0.29、P0.30
   还必须具有相同的方向，因为它们作为USB功能的单元进行操作                       */                        
                                      
// -----------------------------  PIO0_29  ----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO0_29_GPIO            (0x00)                                            // GPIO                         
#define PIO0_29_USB_DD          (0x01)                                            // USB双向数据D+线              
//..    Reserved                (0x02)                                            // 保留                         
//..    Reserved                (0x03)                                            // 保留                         
                                      
// -----------------------------  PIO0_30  ----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO0_30_GPIO            (0x00)                                            // GPIO                         
#define PIO0_30_USB_DS          (0x01)                                            // USB双向数据D-线              
//..    Reserved                (0x02)                                            // 保留                         
//..    Reserved                (0x03)                                            // 保留                         

/***********************************************************************************************************
** P1口引脚功能设置
***********************************************************************************************************/

// -----------------------------  PIO1_0  ------------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO1_0_GPIO             (0x00)                                            // GPIO                         
#define PIO1_0_ENET_TXD0        (0x01)                                            // 以太网发送数据脚0            
//..    Reserved                (0x02)                                            // 保留                         
//..    Reserved                (0x03)                                            // 保留                         

// -----------------------------  PIO1_1  -----------------------------------------------------------------
// FUNC 选择管脚功能 
#define PIO1_1_GPIO             (0x00)                                            // GPIO                         
#define PIO1_1_ENET_TX_EN       (0x01)                                            // 以太网发送数据脚1            
//..    Reserved                (0x02)                                            // 保留                         
//..    Reserved                (0x03)                                            // 保留                         

// -----------------------------  PIO1_4  -----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO1_4_GPIO             (0x00)                                            // GPIO                         
#define PIO1_4_ENET_TX_EN       (0x01)                                            // 以太网发送使能               
//..    Reserved                (0x02)                                            // 保留                         
//..    Reserved                (0x03)                                            // 保留                         

// -----------------------------  PIO1_8  -----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO1_8_GPIO             (0x00)                                            // GPIO                         
#define PIO1_8_ENET_CRS         (0x01)                                            // 以太网载波侦测脚             
//..    Reserved                (0x02)                                            // 保留                         
//..    Reserved                (0x03)                                            // 保留                         
										     
// -----------------------------  PIO1_9  -----------------------------------------------------------------
// FUNC 选择管脚功能 
#define PIO1_9_GPIO             (0x00)                                            // GPIO                         
#define PIO1_9_ENET_RXD0        (0x01)                                            // 以太网接收数据脚0            
//..    Reserved                (0x02)                                            // 保留                         
//..    Reserved                (0x03)                                            // 保留                         
													  
// -----------------------------  PIO1_10  -----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO1_10_GPIO            (0x00)                                            // GPIO                         
#define PIO1_10_ENET_RXD1       (0x01)                                            // 以太网接收数据脚1            
//..    Reserved                (0x02)                                            // 保留                         
//..    Reserved                (0x03)                                            // 保留                         

// -----------------------------  PIO1_14  -----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO1_14_GPIO            (0x00)                                            //  GPIO                        
#define PIO1_14_ENET_RX_ER      (0x01)                                            // 以太网接收错误               
//..    Reserved                (0x02)                                            // 保留                         
//..    Reserved                (0x03)                                            // 保留                         
													     
#define PIO1_14_FNUC            P1_14_GPIO

// -----------------------------  PIO1_15  -----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO1_15_GPIO            (0x00)                                            // GPIO                         
#define PIO1_15_ENET_REF_CLK    (0x01)                                            // 以太网参拷时钟输入           
//..    Reserved                (0x02)                                            // 保留                         
//..    Reserved                (0x03)                                            // 保留                         
											   
// -----------------------------  PIO1_16  -----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO1_16_GPIO            (0x00)                                            // GPIO                         
#define PIO1_16_ENET_MDC        (0x01)                                            // 以太网MIIM时钟               
//..    Reserved                (0x02)                                            // 保留                         
//..    Reserved                (0x03)                                            // 保留                         

// -----------------------------  PIO1_17  -----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO1_17_GPIO            (0x00)                                            // GPIO                         
#define PIO1_17_ENET_MDIO       (0x01)                                            // 以太网MI数据输入\输出        
//..    Reserved                (0x02)                                            // 保留                         
//..    Reserved                (0x03)                                            // 保留                         

// -----------------------------  PIO1_18  -----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO1_18_GPIO            (0x00)                                            // GPIO                        
#define PIO1_18_USB_UP_LED      (0x01)                                            // USB GOODLINK指示脚           
#define PIO1_18_PWM11           (0x02)                                            // PWM1输出，通道1              
#define PIO1_18_CAP10           (0x03)                                            // Timer1捕获输入，通道0        
                                              
// -----------------------------  PIO1_19  -----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO1_19_GPIO            (0x00)                                            //  GPIO                        
#define PIO1_19_MCO0A           (0x01)                                            // 电机控制PWM通道0，输出A      
#define PIO1_19_USB_PPWR        (0x02)                                            // USB端口电源使能信号          
#define PIO1_19_CAP11           (0x03)                                            // Timer1捕获输入，通道1        
                                                    
// -----------------------------  PIO1_20  -----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO1_20_GPIO            (0x00)                                            // GPIO                        
#define PIO1_20_MCFB0           (0x01)                                            // 电机控制PWM通道0，回环输入   
#define PIO1_20_PWM12           (0x02)                                            // PWM-2输出，通道2             
#define PIO1_20_SCK0            (0x03)                                            // SSP-0时钟输入                
                                              
// -----------------------------  PIO1_21  -----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO1_21_GPIO            (0x00)                                            // GPIO                         
#define PIO1_21_MCABORT         (0x01)                                            // 电机控制PWM，紧急中止        
#define PIO1_21_PWM13           (0x02)                                            // PWM-1输出，通道3             
#define PIO1_21_SSEL0           (0x03)                                            // SSP-0从机选择                
                                              
// -----------------------------  PIO1_22  -----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO1_22_GPIO            (0x00)                                            // GPIO                         
#define PIO1_22_MC0B            (0x01)                                            // 电机控制PWM通道0，输出B      
#define PIO1_22_USB_PWRD        (0x02)                                            // USB端口的电源状态            
#define PIO1_22_MAT10           (0x03)                                            // 定时器1匹配输出，通道0       
                                              
// -----------------------------  PIO1_23  -----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO1_23_GPIO            (0x00)                                            // GPIO                         
#define PIO1_23_MCFB1           (0x01)                                            // 电机控制PWM通道1，反馈输入   
#define PIO1_23_PWM14           (0x02)                                            // PWM-1输出，通道4             
#define PIO1_23_MISO0           (0x03)                                            // SSP-0主机输入，从机输出      
                                              
// -----------------------------  PIO1_24  -----------------------------------------------------------------
// FUNC 选择管脚功能 
#define PIO1_24_GPIO            (0x00)                                            // GPIO                         
#define PIO1_24_MCFB2           (0x01)                                            // 电机控制PWM通道2，反馈输入   
#define PIO1_24_PWM15           (0x02)                                            // PWM-1输出，通道5             
#define PIO1_24_MOSI0           (0x03)                                            // SSP-0主机输出，从机输入      
                                              
// -----------------------------  PIO1_25  -----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO1_25_GPIO            (0x00)                                            // GPIO                         
#define PIO1_25_MC1A            (0x01)                                            // 电机控制PWM通道1，输出A      
#define PIO1_25_CLKOUT          (0x02)                                            // 时钟输出引脚                 
#define PIO1_25_MAT11           (0x03)                                            // 定时器1匹配输出，通道1       
                                              
// -----------------------------  PIO1_26  -----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO1_26_GPIO            (0x00)                                            // GPIO                         
#define PIO1_26_MC1B            (0x01)                                            // 电机控制PWM通道1，输出B      
#define PIO1_26_PWM16           (0x02)                                            // PWM-1输出，通道6             
#define PIO1_26_CAP00           (0x03)                                            // 定时器0捕获输入，通道0       
                                              
// -----------------------------  PIO1_27  -----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO1_27_GPIO            (0x00)                                            // GPIO                         
#define PIO1_27_CLKOUT          (0x01)                                            // 时钟输出引脚                 
#define PIO1_27_USB_OVRCR       (0x02)                                            // USB端口过载电流状态          
#define PIO1_27_CAP01           (0x03)                                            // 定时器0捕获输入，通道1       
                                              
// -----------------------------  PIO1_28  -----------------------------------------------------------------
// FUNC 选择管脚功能 
#define PIO1_28_GPIO            (0x00)                                            // GPIO                         
#define PIO1_28_MC2A            (0x01)                                            // 电机控制PWM通道2，输出A      
#define PIO1_28_PCAP10          (0x02)                                            // PWM-1捕获输入，通道0         
#define PIO1_28_MAT00           (0x03)                                            // 定时器0匹配输出，通道0       
                                              
// -----------------------------  PIO1_29  -----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO1_29_GPIO            (0x00)                                            // GPIO                         
#define PIO1_29_MC2B            (0x01)                                            // 电机控制PWM通道2，输出B      
#define PIO1_29_PCAP11          (0x02)                                            // PWM-1捕获输入，通道1         
#define PIO1_29_MAT01           (0x03)                                            // 定时器0匹配输出，通道1       
                                              
// -----------------------------  PIO1_30  -----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO1_30_GPIO            (0x00)                                            // GPIO                         
//...   Reserved                (0x01)                                            // 保留                         
#define PIO1_30_VBUS            (0x02)                                            // 存在的USB总线电源            
#define PIO1_30_AD04            (0x03)                                            // ADC转换器0.通道4输入         
                                              
// -----------------------------  PIO1_31  -----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO1_31_GPIO            (0x00)                                            // GPIO                         
//...   Reserved                (0x01)                                            // 保留                         
#define PIO1_31_SCK1            (0x02)                                            // SSP-1时钟线                  
#define PIO1_31_AD05            (0x03)                                            // ADC-0输入，通道5             
                                              
/***********************************************************************************************************
** P2口引脚功能设置
***********************************************************************************************************/

// -----------------------------  PIO2_0  -----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO2_0_GPIO             (0x00)                                            // GPIO                         
#define PIO2_0_PWM11            (0x01)                                            // PWM-1，通道1                 
#define PIO2_0_TXD1             (0x02)                                            // UART1数据发送引脚            
//...   Reserved                (0x03)                                            // 保留                         

// -----------------------------  PIO2_1  -----------------------------------------------------------------
// FUNC 选择管脚功能 
#define PIO2_1_GPIO             (0x00)                                            // GPIO                         
#define PIO2_1_PWM12            (0x01)                                            // PWM-1，通道2                 
#define PIO2_1_RXD1             (0x02)                                            // UART1数据接收引脚            
//...   Reserved                (0x03)                                            // 保留                         

// -----------------------------  PIO2_2  -----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO2_2_GPIO             (0x00)                                            // GPIO                         
#define PIO2_2_PWM13            (0x01)                                            // PWM-1，通道3                 
#define PIO2_2_CTS1             (0x02)                                            // UART1清零发送线              
//...   Reserved                (0x03)                                            // 保留                         

// -----------------------------  PIO2_3  -----------------------------------------------------------------
// FUNC 选择管脚功能 
#define PIO2_3_GPIO             (0x00)                                            // GPIO                         
#define PIO2_3_PWM14            (0x01)                                            // PWM-1，通道4                 
#define PIO2_3_DCD1             (0x02)                                            // UART1数据载波检测线          
//...   Reserved                (0x03)                                            // 保留                         

// -----------------------------  PIO2_4  -----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO2_4_GPIO             (0x00)                                            // GPIO                         
#define PIO2_4_PWM15            (0x01)                                            // PWM-1，通道5                 
#define PIO2_4_DSR1             (0x02)                                            // UART1数据设置就绪线          
//...   Reserved                (0x03)                                            // 保留                         

// -----------------------------  PIO2_5  -----------------------------------------------------------------
// FUNC 选择管脚功能 
#define PIO2_5_GPIO             (0x00)                                            // GPIO                         
#define PIO2_5_PWM16            (0x01)                                            // PWM-1，通道6                 
#define PIO2_5_DTR1             (0x02)                                            // UART1数据终端就绪线          
//...   Reserved                (0x03)                                            // 保留                         

// -----------------------------  PIO2_6  -----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO2_6_GPIO             (0x00)                                            // GPIO                         
#define PIO2_6_PCAP10           (0x01)                                            // PWM-1捕获输入，通道0         
#define PIO2_6_RI1              (0x02)                                            // UART1振铃输入                
//...   Reserved                (0x03)                                            // 保留                         

// -----------------------------  PIO2_7  -----------------------------------------------------------------
// FUNC 选择管脚功能 
#define PIO2_7_GPIO             (0x00)                                            // GPIO                         
#define PIO2_7_RD2              (0x01)                                            // CAN-2接收线                  
#define PIO2_7_RTS1             (0x02)                                            // UART1请求发送输出            
                                                                                  // RS-485/EIA-485输出使能信号   
//...   Reserved                (0x03)                                            // 保留                         

// -----------------------------  PIO2_8  -----------------------------------------------------------------
// FUNC 选择管脚功能 
#define PIO2_8_GPIO             (0x00)                                            // GPIO                         
#define PIO2_8_TD2              (0x01)                                            // CAN-2发送线                  
#define PIO2_8_TXD2             (0x02)                                            // UART2发送引脚                
#define PIO2_8_ENET_MDC         (0x03)                                            // 以太网MIIM时钟               

// -----------------------------  PIO2_9  -----------------------------------------------------------------
// FUNC 选择管脚功能
#define PIO2_9_GPIO             (0x00)                                            // GPIO                         
#define PIO2_9_U1CONNECT        (0x01)                                            // USB1软连接控制               
#define PIO2_9_RXD2             (0x02)                                            // UART2接收引脚                
#define PIO2_9_ENET_MDIO        (0x03)                                            // 以太网MIIM数据输入和输出     

// -----------------------------  PIO2_10  -----------------------------------------------------------------
// FUNC 选择管脚功能 
#define PIO2_10_GPIO            (0x00)                                            // GPIO                         
#define PIO2_10_EINT0           (0x01)                                            // 外部中断0输入                
#define PIO2_10_NMI             (0x02)                                            // 非屏蔽中断输入               
//...   Reserved                (0x03)                                            // 保留                         
                                              
// -----------------------------  PIO2_11  -----------------------------------------------------------------
// FUNC 选择管脚功能 
#define PIO2_11_GPIO            (0x00)                                            // GPIO                         
#define PIO2_11_EINT1           (0x01)                                            // 外部中断1输入                
//...   Reserved                (0x02)                                            // 保留                         
#define PIO2_11_I2STX_CLK       (0x03)                                            // I2S发送时钟SCK               
                                              
// -----------------------------  PIO2_12  -----------------------------------------------------------------
// FUNC 选择管脚功能 
#define PIO2_12_GPIO            (0x00)                                            // GPIO                         
#define PIO2_12_EINT2           (0x01)                                            // 外部中断2输入                
//...   Reserved                (0x02)                                            // 保留                         
#define PIO2_12_I2STX_WS        (0x03)                                            // I2S发送字选择WS              
                                              
// -----------------------------  PIO2_13  -----------------------------------------------------------------
// FUNC 选择管脚功能  
#define PIO2_13_GPIO            (0x00)                                            // GPIO                         
#define PIO2_13_EINT3           (0x01)                                            // 外部中断3输入                
//...   Reserved                (0x02)                                            // 保留                         
#define PIO2_13_I2STX_SDA       (0x03)                                            // I2S发送数据SD                  
                                         
/***********************************************************************************************************
** P3口引脚功能设置
***********************************************************************************************************/

// -----------------------------  PIO3_25  -----------------------------------------------------------------
// FUNC 选择管脚功能  
#define PIO3_25_GPIO            (0x00)                                            //  GPIO                        
//...   Reserved                (0x01)                                            //  保留                        
#define PIO3_25_MAT00           (0x02)                                            //  定时器0匹配输出，通道0      
#define PIO3_25_PWM12           (0x03)                                            //  PWM-1输出，通道2            
                                               
// -----------------------------  PIO3_26  -----------------------------------------------------------------
// FUNC 选择管脚功能 
#define PIO3_26_GPIO            (0x00)                                            // GPIO                         
#define PIO3_26_STCLK           (0x01)                                            // 系统节拍定时器时钟输入       
#define PIO3_26_MAT01           (0x02)                                            // 定时器0匹配输出，通道1       
#define PIO3_26_PWM13           (0x03)                                            // PWM-1输出，通道3              
                                          
/***********************************************************************************************************
** P4口引脚功能设置
***********************************************************************************************************/

// -----------------------------  PIO4_28  -----------------------------------------------------------------
// FUNC 选择管脚功能 
#define PIO4_28_GPIO            (0x00)                                            // GPIO                         
#define PIO4_28_RX_MCLK         (0x01)                                            // —I2S接收主机时钟            
#define PIO4_28_MAT20           (0x02)                                            // 定时器2匹配输出，通道0       
#define PIO4_28_TXD3            (0x03)                                            // UART3发送引脚                
                                               
// -----------------------------  PIO4_29  -----------------------------------------------------------------
// FUNC 选择管脚功能  
#define PIO4_29_GPIO            (0x00)                                            // GPIO                         
#define PIO4_29_TX_MCLK         (0x01)                                            // I2S发送主机时钟              
#define PIO4_29_MAT21           (0x02)                                            // 定时器2匹配输出，通道1       
#define PIO4_29_RXD3            (0x03)                                            // UART3接收引脚                                                                  
                                          
/***********************************************************************************************************
**    The Trace Port Interface Unit (TPIU)
***********************************************************************************************************/
#define GPIO_TPIU_DI            (0x00)                                            // TPIU interface 禁止          
#define GPIO_TPIU_EN            (0x01)                                            // TPIU interface 使能          

/***********************************************************************************************************
** 引脚内部上下拉电阻配置
***********************************************************************************************************/
#define GPIO_PULL_UP            (0x00)                                            // 引脚内部上拉                 
#define GPIO_REPEATER           (0x01)                                            // 中继模式                 
#define GPIO_NO_PULL            (0x02)                                            // 引脚既不上拉，也不下拉       
#define GPIO_PULL_DOWN          (0x03)                                            // 引脚内部下拉              

/***********************************************************************************************************
** 全局函数
***********************************************************************************************************/
extern void GPIOInit(void);											              // 初始化
extern void GPIOSetMode(u8 portNum, u8 bitPosi, u8 fun, u8 mode, u8 openDrain);   // 管脚配置
extern void GPIOSetDir(u8 portNum, u8 bitPosi, u8 dir);		                      // 方向设置
extern void GPIOSetMultiDir(u8 portNum, u32 mBitPosi, u8 dir);					  // 多端口方向设置
extern void GPIOSetValue(u8 portNum, u8 bitPosi, u8 bitVal);	                  // 管脚输出
extern void GPIOSetMultiValue(u8 portNum, u32 mBitPosi, u32 val);	              // 写并口
extern u8   GPIOStatusValue(u8 portNum, u8 bitPosi);				              // 读取管脚
extern u32  GPIOStatusMultiValue(u8 portNum, u32 shield);				          // 读并口

extern void GPIOIntSet(u8 portNum, u8 bitPosi, u8 risEg, u8 falEg);               // 中断设置
extern u8   GPIOIntStatus(u8 portNum, u8 bitPosi);						          // 读取管脚中断状态
extern void GPIOIntClear(u8 portNum, u8 bitPosi);						          // 清管脚上的中断

/*******************************************************************************************************/
#endif

/********************************************************************************************************
*                              End Of File         
********************************************************************************************************/
