/******************************************************************************************************** 
*                             
*                                    Address
*  
*                    (c) Copyright 20xx, Company Name, City, State
*                               All Rights Reserved
*
*
* FileName       : Buzzer.c
* Version        : V2.0
* Programmer(s)  : zhaojun_xf
* Parameters     : LPC1700 12.000MHz
* DebugTools     : Realview MDK V4.23  JLINK V8(SWD)
* Description    :
*
*
********************************************************************************************************/

/********************************************************************************************************
* HeaderFiles                            
********************************************************************************************************/ 
#include "../UserCode/source/config.h"   			                           // 头文件

/********************************************************************************************************
* FunctionName   : BUZInit()
* Description    : 初始化
* EntryParameter : None
* ReturnValue    : None
********************************************************************************************************/
void BUZInit(void)
{
	BZR_CTRL_OUT();					                                           // 设置端口为输出端口	
	BZR_CTRL_WRITE(BZR_OFF);			                                       // 关闭蜂鸣器
}

/********************************************************************************************************
* FunctionName   : BUZ_DelayMs()
* Description    : 延时
* EntryParameter : ms - 延时毫秒
* ReturnValue    : None
********************************************************************************************************/
void BUZ_DelayMs(u16 ms)
{
    u16 i;

	while (ms--)
	{
	    for (i=16663; i>0; i--)	
		{
		    ;
		}
	}
}

/********************************************************************************************************
* FunctionName   : BUZCtrl()
* Description    : 蜂鸣器开关控制
* EntryParameter : sw - 开关（0-开，1-关）
* ReturnValue    : None
********************************************************************************************************/
void BUZCtrl(u8 sw)
{
    (sw == 0) ? BZR_CTRL_WRITE(BZR_ON) : BZR_CTRL_WRITE(BZR_OFF);
}

/********************************************************************************************************
* FunctionName   : BUZSound()
* Description    : 蜂鸣器响声
* EntryParameter : times - 响声次数，onTime - 开蜂鸣器的时间，offTime - 关蜂鸣器的时间
* ReturnValue    : None
********************************************************************************************************/
void BUZSound(u8 times, u16 onTime, u16 offTime)
{
    while (times--)
	{
	    BZR_CTRL_WRITE(BZR_ON);			                            // 开
		BUZ_DelayMs(onTime);

		BZR_CTRL_WRITE(BZR_OFF);			                        // 关
		BUZ_DelayMs(offTime);
	} 
}

/********************************************************************************************************
* End Of File                  
********************************************************************************************************/
