/******************************************************************************************************** 
*                                 LPC1700 工程模块
*                                    Address
*  
*                    (c) Copyright 20xx, Company Name, City, State
*                               All Rights Reserved
*
*
* FileName       : TPC.c
* Version        : V2.0
* Programmer(s)  : zhaojun_xf
* Parameters     : LPC1700 12.000MHz
* DebugTools     : Realview MDK V4.23              JLINK V8(SWD)
* Description    : 
*				   Time-chip processing cores
*
********************************************************************************************************/

/********************************************************************************************************
* HeaderFiles                            
********************************************************************************************************/ 
#include "../UserCode/source/config.h"    			                        // 头文件

/********************************************************************************************************
* Variable Definition                            
********************************************************************************************************/
u8 TPCTaskNum = 0;

/********************************************************************************************************
* FunctionName   : TPCRemarks()
* Description    : 任务标志处理
* EntryParameter : None
* ReturnValue    : None
********************************************************************************************************/
void TPCRemarks(TPC_TASK *pTask)
{
    u8 i;

	for (i=0; i<TPCTaskNum; i++)					                           
	{
	    if (pTask[i].Timer > 0)									               
		{
		    pTask[i].Timer--;								                   // 减去一个节拍
		
			if (pTask[i].Timer == 0)						                   // 时间减完了
			{
				pTask[i].Timer = pTask[i].ItvTime;                             // 恢复计时器值
				pTask[i].Run   = TPC_RUN_STM;						           // 置运行标志
			} 
		}
	}
}

/********************************************************************************************************
* FunctionName   : TPCProcess()
* Description    : 任务处理
* EntryParameter : None
* ReturnValue    : None
********************************************************************************************************/
void TPCProcess(TPC_TASK *pTask)
{
    u8 i;

	for (i=0; i<TPCTaskNum; i++)					                           
	{
	    if (pTask[i].Run == TPC_RUN_STM)									   // 运行标志判断
		{
			pTask[i].Task();							                       // 运行任务
			pTask[i].Run = TPC_RUN_CLM;								           // 标志清0
		}
	}   
}												 

/********************************************************************************************************
*                              End Of File         
********************************************************************************************************/
