/******************************************************************************************************** 
*                             
*                                    Address
*  
*                    (c) Copyright 20xx, Company Name, City, State
*                               All Rights Reserved
*
*
* FileName       : wdt.c
* Version        : V2.0
* Programmer(s)  : zhaojun_xf
* Parameters     : LPC1700 12.000MHz
* DebugTools     : Realview MDK V4.23  JLINK V8(SWD)
* Description    :
*
*
********************************************************************************************************/

/********************************************************************************************************
* HeaderFiles                            
********************************************************************************************************/ 
#include "../UserCode/source/config.h"     			 // 头文件

/********************************************************************************************************
* FunctionName   : WDTInit()
* Description    : 初始化看门狗
* EntryParameter : time - 定时时间（1~170000ms）
* ReturnValue    : None
********************************************************************************************************/
void WDTInit(u32 time)
{ 	
    u32 clock = SystemCoreClock/4;
			 
	LPC_WDT->WDCLKSEL |= WDSEL_APB;			                                // 选择WDT时钟源

	LPC_WDT->WDTC   = (clock/4000) * time;			                        // 定时时间（WDT时钟已经4分频）
	LPC_WDT->WDMOD |= WDRESET;		                                        // 使能WDT溢出后复位

	WDTEnable();															// 使能看门狗
	WDTFeed();								                                // 喂狗启动看门狗
}

/********************************************************************************************************
* FunctionName   : WDTFeed()
* Description    : 看门狗喂狗
* EntryParameter : None
* ReturnValue    : None
********************************************************************************************************/
void WDTFeed(void)
{
    DisableIRQ();                                                           // 关闭中断

    LPC_WDT->WDFEED = 0xAA;					                                // 喂狗
	LPC_WDT->WDFEED = 0x55;

	EnableIRQ();                                                            // 开启中断	  
}

/********************************************************************************************************
* FunctionName   : WDTFeed()
* Description    : 看门狗喂狗
* EntryParameter : None
* ReturnValue    : None
********************************************************************************************************/
void WDTEnable(void)
{
    LPC_WDT->WDMOD |= WDEN;
}

/********************************************************************************************************
* FunctionName   : WDTGetCountValue()
* Description    : 获取看门狗计数值
* EntryParameter : None
* ReturnValue    : None
********************************************************************************************************/
u32 WDTGetCountValue(void)
{
	return (LPC_WDT->WDTV);
}

/********************************************************************************************************
* End Of File                  
********************************************************************************************************/
