/******************************************************************************************************** 
*                             
*                                    Address
*  
*                    (c) Copyright 20xx, Company Name, City, State
*                               All Rights Reserved
*
*
* FileName       : wdt.h
* Version        : V2.0
* Programmer(s)  : zhaojun_xf
* Parameters     : LPC1700 12.000MHz
* DebugTools     : Realview MDK V4.23  JLINK V8(SWD)
* Description    : 
*
*
********************************************************************************************************/

#ifndef __WDT_H 
#define __WDT_H

/******************************************************************************************************** 
* 【寄存器】 Register                                              
********************************************************************************************************/

// 模式寄存器（WDMOD-0x4000 0000）
#define WDEN			     (0x01 << 0)						           // 看门狗使能位（写"1"启动定时器）
#define WDRESET			     (0x01 << 1)						           // 看门狗复位使能
#define WDTOF			     (0x01 << 2)						           // 看门狗超时标志
#define WDINT			     (0x01 << 3)						           // 看门狗中断标志

// 时钟源选择寄存器（WDCLKSEL-0x4000 0010）
#define WDSEL_IRC			 (0x00 << 0)						           // 选择内部RC（默认）
#define WDSEL_APB			 (0x01 << 0)						           // 选择APB外设时钟源
#define WDSEL_RTC			 (0x02 << 0)						           // 选择RTC振荡器

#define WDLOCK			     (0x01 << 31)						           // 锁定寄存器中的值

/********************************************************************************************************
* Global Function                                                 
********************************************************************************************************/
extern void WDTInit(u32 time);						                       // 初始化看门狗
extern void WDTFeed(void);						                           // 看门狗喂狗

extern void WDTEnable(void);											   // 看门狗使能
extern u32  WDTGetCountValue(void);										   // 获取看门狗计数值

/*******************************************************************************************************/
#endif

/********************************************************************************************************
* End Of File         
********************************************************************************************************/
