/******************************************************************************************************** 
*                             
*                                    Address
*  
*                    (c) Copyright 20xx, Company Name, City, State
*                               All Rights Reserved
*
*
* FileName       : rit.c
* Version        : V2.0
* Programmer(s)  : zhaojun_xf
* Parameters     : LPC1700 12.000MHz
* DebugTools     : Realview MDK V4.23  JLINK V8(SWD)
* Description    :
*
*
********************************************************************************************************/

/********************************************************************************************************
* HeaderFiles                            
********************************************************************************************************/ 
#include "../UserCode/source/config.h"  			                          // 头文件

/********************************************************************************************************
* FunctionName   : RITInit()
* Description    : 初始化函数
* EntryParameter : nMs - n ms
* ReturnValue    : None
********************************************************************************************************/
void RITInit(u32 nMs)
{
    u8 ratio = 4;									                          // 外设时钟与内核时钟的比例

	LPC_SC->PCONP |= (1 << 16);						                          // 打开RIT电源

	LPC_RIT->RICOMPVAL = ((SystemCoreClock/ratio)/1000) * nMs;                // 设置比较寄存器
	LPC_RIT->RIMASK	   = 0x00000000;				                          // 屏蔽寄存器
	LPC_RIT->RICTRL	   = RIT_INT | RIT_ENCLR | RIT_EN;	                      // 控制寄存器
	LPC_RIT->RICOUNTER = 0x00000000;			                              // 32位计数器

	NVIC_EnableIRQ(RIT_IRQn);		                                          // Enable the TIMER0 Interrupt
}

/********************************************************************************************************
* End Of File                  
********************************************************************************************************/
