/********************************************************************************************************
*                             
*                                    Address
*  
*                    (c) Copyright 20xx, Company Name, City, State
*                               All Rights Reserved
*
*
* FileName       : Mnu.h
* Version        : V1.0
* Programmer(s)  :
* Parameters     : ARM LPC1700  12MHz
* DebugTools     : JLINK V8.0 And Realview MDK V4.22
* Description    : 
*
*
********************************************************************************************************/

#ifndef __Mnu_H 
#define __Mnu_H

/********************************************************************************************************
* Variable definition                                               
********************************************************************************************************/
// 菜单参数
typedef struct _Mnu_PRMT
{
	u8 Cursor;												               // 光标值(当前光标位置)
	u8 PageNo;												               // 菜单页(显示开始项)
	u8 Index;												               // 菜单索引(当前选择的菜单项)
	u8 DispNum;												               // 显示项数(每页可以现在菜单项)
	u8 MaxPage;												               // 最大页数(最大有多少种显示页) 

} Mnu_PRMT;

extern Mnu_PRMT MnuPrmt;
//-------------------------------------------------------------------------------------------------------

// 菜单执行
typedef struct _Mnu_TABLE
{
	u8 *MnuItem;											               // 菜单项目名称
	u8 (*ItemHook)(u8 key);							                       // 要运行的菜单函数

} Mnu_TABLE;

#define MNU_PAGE_DIS		(3)									           // 页显示项数

//-------------------------------------------------------------------------------------------------------
typedef enum
{
    MNU_KV_NO = 0x00,					                                   // 无
	MNU_KV_UP = 0x02,					                                   // 上
	MNU_KV_DN = 0x04,					                                   // 下
	MNU_KV_MD = 0x08,					                                   // 中
	MNU_KV_LF = 0x10,					                                   // 左
	MNU_KV_RT = 0x20,					                                   // 右

} MNU_KEY_VALUE;														   // 按键值

/********************************************************************************************************
* Extern Function                                                  
********************************************************************************************************/
#define MNU_DISP_NML(x, y, mnu)	 LCMDisplayStr1(0, i+1, LCM_DIS_NML, mnu)  // 正常显示
#define MNU_DISP_RVS(x, y, mnu)	 LCMDisplayStr1(0, i+1, LCM_DIS_RVS, mnu)  // 反白显示

/********************************************************************************************************
* Global Function                                                 
********************************************************************************************************/
extern void MnuPrmtInit(Mnu_PRMT *prmt);								   // 初始化菜单参数
extern void MnuSetPrmt(Mnu_PRMT *prmt, u8 num, u8 page);				   // 设置菜单显示参数
extern u8   MnuMove(Mnu_PRMT *prmt, u8 key); 							   // 菜单移动
extern void MnuDisplay(Mnu_TABLE *mnu, u8 page, u8 dispNum, u8 cursor);    // 显示菜单

/*******************************************************************************************************/
#endif

/********************************************************************************************************
* End Of File         
********************************************************************************************************/
