/******************************************************************************************************** 
*                             
*                                    Address
*  
*                    (c) Copyright 20xx, Company Name, City, State
*                               All Rights Reserved
*
*
* FileName       : SysTick.c
* Version        : V2.0
* Programmer(s)  : zhaojun_xf
* Parameters     : LPC1700 12.000MHz
* DebugTools     : Realview MDK V4.23  JLINK V8(SWD)
* Description    :
*
*
********************************************************************************************************/

/********************************************************************************************************
* HeaderFiles                            
********************************************************************************************************/ 
#include "../UserCode/source/config.h"    			                  // 头文件				

/********************************************************************************************************
* FunctionName   : SysTickInit()
* Description    : 初始化SysTick
* EntryParameter : tMs - n ms
* ReturnValue    : None
********************************************************************************************************/
void SysTickInit(u32 tMs)
{ 
    SysTick_Config((SystemCoreClock/1000) * tMs);	                      // 初始化并启动滴答定时器，包括中断配置
}

/********************************************************************************************************
* FunctionName   : SysTickClear()
* Description    : SysTick清零
* EntryParameter : None
* ReturnValue    : None
********************************************************************************************************/
void SysTickClear(void)
{
    SysTick->VAL = 0;
}

/********************************************************************************************************
* FunctionName   : SysTickDisable()
* Description    : 禁止定时器
* EntryParameter : None
* ReturnValue    : None
********************************************************************************************************/
void SysTickDisable(void)
{
    SysTick->CTRL &= ~STC_ENABLE;									      // 清零 ENABLE
}

/********************************************************************************************************
* FunctionName   : SysTickEnable()
* Description    : 使能定时器
* EntryParameter : None
* ReturnValue    : None
********************************************************************************************************/
void SysTickEnable(void)
{
    SysTick->CTRL |= STC_ENABLE;									      // 置一 ENABLE
}

/********************************************************************************************************
* FunctionName   : SysTickLoad()
* Description    : 定时器重装值
* EntryParameter : None
* ReturnValue    : None
********************************************************************************************************/
void SysTickLoad(u32 tMs)
{
    SysTick->LOAD = (0xFFFFFF & ((SystemCoreClock/1000) * tMs)) - 1;     // 定时时间设置
}

/********************************************************************************************************
* FunctionName   : SysTickGetValue()
* Description    : 获取定时器当前值
* EntryParameter : None
* ReturnValue    : 返回定时器当前值
********************************************************************************************************/
u32 SysTickGetValue(void)
{
    return ((SysTick->VAL) & (0xFFFFFF)); 
}

/********************************************************************************************************
* End Of File                  
********************************************************************************************************/
