/******************************************************************************************************** 
*                             
*                                    Address
*  
*                    (c) Copyright 20xx, Company Name, City, State
*                               All Rights Reserved
*
*
* FileName       : SysTick.h
* Version        : V2.0
* Programmer(s)  : zhaojun_xf
* Parameters     : LPC1700 12.000MHz
* DebugTools     : Realview MDK V4.23  JLINK V8(SWD)
* Description    : 
*
*
********************************************************************************************************/

#ifndef __SYSTICK_H 
#define __SYSTICK_H

/******************************************************************************************************** 
* 【寄存器】 Register                                              
********************************************************************************************************/

// STCTRL系统定时器控制和状态寄存器
#define STC_ENABLE			  (0x01 << 0)				                     // 系统节拍计数器使能
#define STC_TICKINT			  (0x01 << 1)				                     // 系统节拍中断使能
#define STC_CLKSOURSE		  (0x01 << 2)				                     // 系统节拍时钟源的选择
#define STC_COUNTFLAG		  (0x01 << 16)			                         // 系统节拍计数器标志

// STCALIB 系统定时器校准寄存器
#define STC_TENMS			  (0x01 << 0)				                     // 系统节拍溢出率的值
#define STC_SKEW			  (0x01 << 30)				                     // 显示TENMS是否会准确地产生中断
#define STC_NOREF		      (0x01 << 31)				                     // 显示是否有可用的外部参考时钟

/********************************************************************************************************
* GlobalFunction                                                 
********************************************************************************************************/
extern void SysTickInit(u32 tMs);				                             // 初始化SysTick
extern void SysTickLoad(u32 tMs);										     // 定时器重装

extern void SysTickClear(void);												 // 清零计数器
extern u32  SysTickGetValue(void);											 // 获取计数值
extern void SysTickDisable(void);					                         // 禁止定时器
extern void SysTickEnable(void);					                         // 使能定时器

/*******************************************************************************************************/
#endif

/********************************************************************************************************
* End Of File         
********************************************************************************************************/
