/******************************************************************************************************** 
*                             
*                                    Address
*  
*                    (c) Copyright 20xx, Company Name, City, State
*                               All Rights Reserved
*
*
* FileName       : irControl.c
* Version        : V2.0
* Programmer(s)  : zhaojun_xf
* Parameters     : LPC1700 12.000MHz
* DebugTools     : Realview MDK V4.23  JLINK V8(SWD)
* Description    :
*
*
********************************************************************************************************/

/********************************************************************************************************
* header file                                                 
********************************************************************************************************/
#include "../UserCode/source/config.h" 

/********************************************************************************************************
* global variable                                              
********************************************************************************************************/

/********************************************************************************************************
* FunctionName   : IRC_DelayUs()
* Description    : 红外解码延时函数(下面的函数都以0.14MS为单位延时)
* EntryParameter : us - 微秒延时
* ReturnValue    : None
********************************************************************************************************/
void IRC_DelayUs(u16 us) 
{
    u16 i;

    while(us--)
	{
	    for (i=14; i>0; i--)
		{
		    ;      
		}
	}
}

/********************************************************************************************************
* FunctionName   : IRCInit()
* Description    : 红外引脚初始化
* EntryParameter : None
* ReturnValue    : None
********************************************************************************************************/
void IRCInit(void)
{
	IRC_IO_OUT();			 						 // 设置端口为输入，默认情况就为输入方式，所以可以不设置
}	

/********************************************************************************************************
* FunctionName   : IRCDecode()
* Description    : 红外解码函数，利用普通端口解码，也可以用外中断解码
* EntryParameter : None
* ReturnValue    : 返回按键编码
********************************************************************************************************/
u8 IRCDecode(void)
{
    u8 i, j, num = 0;
	u8 tmp = 0;
	u8 irCom[4] = {0}; 	                                                         // irCom[0]和irCom[1]存放用户编码；irCom[2]键值码暂存；irCom[3]键值反码存放.

	if (IRC_IO_READ())															 // 等待IR信号出现
	{
	    return IRC_NL;
	}
	
	while (!IRC_IO_READ())	                                                     // 等IR变为高电平，跳过9ms的前导低电平信号
	{
	     IRC_DelayUs(140);
	}                        

	for (i=0; i<4; i++)															 // 读4字节按键编码 = 16位的用户码+8位键值码+8位键值反码	
	{ 
		for (j=0; j<8; j++)                                                      // 8位一接收
		{
		    while (IRC_IO_READ()) ;		                                         // 等IR变为低电平，跳过4.5ms的前导高电平信号    	 
		    while (!IRC_IO_READ());		                                         // 等 IR 变为高电平		         	  	   
		   
		    num = 0;
		    while (IRC_IO_READ())                                                // 计算IR高电平时长
			{
			    IRC_DelayUs(110);
			    num++;           
			    if (num >= 30)
			    {
			        return IRC_NL;												 //	计数过长自动离开
			    }
			}

		    irCom[i] >>= 1;                                                      // 接收数据右移一位
		    if (num >= 8)
		    {
		        irCom[i] |= 0x80;                                                // 电平长度大于等于8，则写入高电平
		    } 
		}                                                                        
	}                                                                            
                 
	tmp = ~irCom[3];							                                 // 反码取反，如果反码不暂存而是直接使用，会错误
	if (irCom[2] != tmp)                                                         // 8位键码!=8位键反码:按键错误
	{
	    return IRC_NL;
	}   

	return irCom[2];                                                             // 返回编码
}

/********************************************************************************************************
* FunctionName   : IRCGetValue()
* Description    : 获取按键值
* EntryParameter : None
* ReturnValue    : 返回按键值
********************************************************************************************************/
u8 IRCGetValue(void)
{
    return 0;
}

/********************************************************************************************************
*                                         End Of File                  
********************************************************************************************************/
